/**
 * Vue课程安排:
 * 1.Vue基础内容---6天
 * 2.Vue的pc前台项目(电商)---6天
 * 3.Vue的后台项目(电商)---6天
 * 保守估计Vue新版课程是18天(有可能会延期)
 * 4.微信的小程序及项目(5天安排)
 * 5.实战(8天左右)
 * 课程介绍:
 * 1.Vue的核心内容:基础相关的知识点
 * 2.todolist案例:组件之间的通信
 * 3.异步的相关的操作
 * 4.Vuex的操作
 * 5.源码的分析
 * 
 * 
 * 总结:
 * Vue是一个渐进式的JS框架
 * 渐进式:本身实现的功能有限,只要引入相关的包或者是插件,就可以实现更多的功能
 * Vue的作者:尤雨溪
 * 
 * 
 * Vue 不支持 IE8 及以下版本，因为 Vue 使用了 IE8 无法模拟的 ECMAScript 5 特性。但它支持所有兼容 ECMAScript 5 的浏览器。
 * 
 * MVVM: 是一种模式,M ----V-----VM 
 * M----数据Model
 * V----view  视图
 * VM----Vue的实例对象
 * 
 * 如果数据变化了,视图就会改变,改变视图,数据也会变化,就通过Vue来连接这种关系，也是一种方式,也是一种模式,MVVM模式，通过代码会理解的更深入一些
 * 
 * 
 * Vue中有模版,有数据绑定,有组件化,有虚拟DOM,Vue借鉴了React和angular
 * 
 * Vue.js 不支持 IE8 及其以下版本，因为 Vue.js 使用的 ECMAScript 5 特性在 IE8 无法模拟。Vue.js 支持所有兼容 ECMAScript 5 的浏览器。
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * Vue开发(编写代码)
 * 步骤(流程):
 * 1.安装Vue相关的包(相关的文件)
 * 2.安装三种方式:
 *  1) 直接通过BootCDN引入
 *  在线方式
 * <script src="https://cdn.bootcss.com/vue/2.6.10/vue.js"></script>
 *  2) 直接下载Vue的相关文件,引入vue.js文件
 *  在www.github.com中搜索Vue,然后找到对应的相关的文件,找master分支,直接下载压缩包
 *  在该压缩包中找dist目录,里面找vue.js文件,直接在自己的开发的html文件中引入即可
 *  3)
 *  下载脚手架的方式,直接可以在内部进行Vue的相关的开发(2的版本和3的版本)
 * 
 * 
 * DHTML----动态页面
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
