/**
 * 
 * todoList案例
 * 
 * 1. Vue组件之间的通信方式
 * Vue中组件的关系:父子组件(直接/间接),兄弟组件
 * props方式: 父子组件之间通信---->父传子(子传父)
 * 自定义事件:父子组件之间通信---父传子
 * 事件总线:任意组件之间通信
 * PubSub:不属于Vue的插件,但是可以使用,任意组件之间通信
 * 插槽:命名插槽(具名插槽),父子组件之间通信(普通插槽,作用域插槽)
 * Vuex:任意组件之间通信
 * 扩展的回答---React中组件之间通信的方式
 * 
 * 
 * 
 * 
 * 
 * 2. Vue中如何发送异步的请求
 * vue-resource ----插件---ajax异步操作
 * axios:封装版本的ajax---插件---ajax异步操作----请求和响应拦截器
 * 
 * 3. Vue中路由
 * 前端路由:映射关系-------->链接地址:组件
 * 点击链接,跳转,显示对应的组件内容
 * 
 * 
 * 今日内容:
 * 1. 路由
 * 2. Vuex
 * 3. 复习(基本js的复习)
 * 4. Vue的源码
 * 5. 讲解Vue中的深入的东西
 * 6. Vue项目
 * 
 * 
 * 
 * 
 * 
 * 
 */